my-ruby.org
#+TITLE:  rudy Configuration Settings
#+AUTHOR: JJ Asghar
#+EMAIL:  jjasghar@gmail.com

* General
 A lot of this  stolen from: [[http://github.com/howardabrams][howard abrams]] I've learned a TON from him.

* ruby-mode settings

   Make sure that the random other types of ruby files are started up in ruby-mode.

   #+begin_src emacs-lisp :tangle yes
  (when (require 'ruby-mode nil t)
    (add-to-list 'auto-mode-alist '("\\.rb$"          . ruby-mode))
    (add-to-list 'interpreter-mode-alist '("ruby"     . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.rake\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("Rakefile\\'"     . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.gemspec\\'"   . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.ru\\'"        . ruby-mode))
    (add-to-list 'auto-mode-alist '("Gemfile\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("Guardfile\\'"    . ruby-mode))
    (add-to-list 'auto-mode-alist '("Capfile\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.thor\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.rabl\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("Thorfile\\'"     . ruby-mode))
    (add-to-list 'auto-mode-alist '("Vagrantfile\\'"  . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.jbuilder\\'"  . ruby-mode))
    (add-to-list 'auto-mode-alist '("Podfile\\'"      . ruby-mode))
    (add-to-list 'auto-mode-alist '("\\.podspec\\'"   . ruby-mode))
    (add-to-list 'auto-mode-alist '("Berksfile\\'"    . ruby-mode)))
   #+end_src

* erb settings

   Run web-mode when you have an .erb, makes reading it SO much better.

   #+begin_src emacs-lisp :tangle yes
  (when (require 'web-mode nil t)
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode)))
   #+end_src

* rubocop settings
   Any time that a ruby file is loaded it's a rarity that I won't want rubocop enabled.

   Don't forget that rubocop packages and gem install rubocop

   #+begin_src emacs-lisp :tangle yes
  ;; rubocop mode
  (when (require 'rubocop nil t)
    (add-hook 'ruby-mode-hook 'rubocop-mode))
   #+end_src
